/**
 * Created by nizhiwei on 2017/5/2.
 */
let arr=[
    "马哈维亚•辛格•珀尕（阿米尔•汗饰）曾是印度国家摔跤冠军，因生活所迫放弃摔跤。他希望让儿子可以帮他完成梦想——赢得世界级金牌。结果生了四个女儿本以为梦想就此破碎的辛格却意外发现女儿身上的惊人天赋，看到冠军希望的他决定不能让女儿的天赋浪费，像其他女孩一样只能洗衣做饭过一生，再三考虑之后，与妻子约定一年时间按照摔跤手的标准训练两个女儿：换掉裙子 、剪掉了长发，让她们练习摔跤，并赢得一个又一个冠军，最终赢来了成为榜样激励千千万万女性的机会……"
    ,"漫威影业最新力作《银河护卫队2》带着全新劲爆好听的“劲歌金曲第二辑”回归大银幕！银河护卫队在本集中穿越宇宙，继续外太空的史诗冒险之旅。他们必须共同作战，守护彼此；同时要解开“星爵”彼得•奎尔的身世之谜。旧日敌人变为盟友，漫画中深受喜爱的角色也会现身，对护卫队出手援助。漫威电影宇宙则将持续扩张，进入新纪元！"
    ,"本片改编自亚瑟王圣剑的传说，剧情颠覆传统，一路探索亚瑟从市井到王座的征途。亚瑟的父亲在他小时候就惨遭杀害，亚瑟的叔叔伏提庚（裘德•洛 Jude Law 饰）篡取王位，剥夺了亚瑟（查理•汉纳姆 Charlie Hunnam 饰）的天赐之权。他浑然不知自己的身世，在城市的穷街陋巷里摸爬滚打着长大，但当他拔出石中剑，他的人生就彻底地天翻地覆了，亚瑟不得不接受自己真正的使命。"
    ,"五个在校园被孤立的高中生，因为青春的荷尔蒙面临着许许多多的烦恼与迷茫。同时，黑暗势力丽达女王正蠢蠢欲动，为了寻找更多能量打造金人怪兽哥达来到地球。五名青少年命中注定地相遇，团结克服难关成为五色超凡战队，与他们的恐龙佐德人机合一雷霆出击拯救世界，毁天灭地一触即发……"
    ,"以茅趸华（刘青云饰）为首的一群古惑仔自诩慈云山十三太保，他们打劫、砍人、吸毒、贩毒，挥霍着他们无处安放的青春。时代变迁，物是人非，唯有茅趸华、猫仔、喇叭、哈雷四兄弟始终不离不弃，继续在他们的人生中活出精彩，直至今日，江湖依然有他们的传说！"
    ,"东北某地，杨百万与妻子马丽莲经营着“仙客来大饭店”。杨百万人到中年得了不举之症，偏偏马丽莲又是个性感、泼辣的母老虎，杨百万自尊心受挫，整日忧心冲冲。终于有一天，杨百万断定马丽莲给自己戴了绿帽子，一气之下找到了神医毕见效，两人策划了一出报复马丽莲的计划… 当夜，杀手如期而至，可两个劫匪和一对临时情侣却阴差阳错的来到了饭店，并双双卷入事件当中。原本毫不相干的几拨人互相影响，使原本就扑朔迷离的局势变得更加的出人意料。每个人都为了达到各自的目的而经历了一番提心吊胆的遭遇，继而引发了一系列荒诞、可笑的怪事。与此同时，他们各自的命运也改变了…"
    ,"首位连续出演两部《谍中谍》的女星蕾贝卡•弗格森（Rebecca Ferguson）最近加盟一部Skydance公司制作的原创科幻电影《生命》（Life），该片将由《安全屋》（Safe House）导演丹尼尔•埃斯皮诺萨（Daniel Espinosa）执导。 《生命》讲述的是国际空间站宇航员在对一份从火星取回的样本检测后，发现其中显现出生命迹象，而且是一种比人类预料的智慧的多的生命。目前还没有更进一步的细节，不清楚这部科幻片有无恐怖、惊悚成分。"
    ,"故事发生在《加勒比海盗3：世界的尽头》沉船湾之战20年后。 亡灵萨拉查船长（哈维尔•巴登 Javier Bardem 饰）率领自己的亡灵海军杀出了世界的尽头，“深海阎王”威尔•特纳（奥兰多•布鲁姆 Orlando Bloom 饰）乘飞翔的荷兰人号前来追杀却被其引入百慕大三角生死未卜。 获取自由的萨拉查肆虐加勒比海，征服了整个海域，即便是手刃了“黑胡子”爱德华•蒂奇（伊恩•麦柯肖恩 Ian McShane 饰）的海盗王赫克托•巴博萨船长（杰弗里•拉什 Geoffrey Rush 饰）也难以避免心爱的安妮女王复仇号沉入大海的惨剧。 幸存下来的巴博萨在女巫Haifaa Meni(格什菲•法拉哈尼 Golshifteh Farahani 饰)口中得知了萨拉查的真实目的：为寻找他的宿敌杰克船长（约翰尼•德普 Johnny Depp 饰），遂重返皇家海军，展开了复仇旅程。 而在父亲蒂格船长（基思•理查兹 Keith Richards 饰）指引下，杰克也将乘着失而复得的黑珍珠号再次扬帆起航，率领聪明美丽的天文学家卡琳娜•史密斯（卡雅•斯考达里奥 Kaya Scodelario 饰）以及与威尔•特纳有着神秘联系的年轻皇家海军亨利（布兰顿•思怀兹 Brenton Thwaites 饰），一起去寻找唯一有可能击败萨拉查的宝物：传说中海神波塞冬的三叉戟。 加勒比的碧海之上将会燃起前所未见的硝烟。"
    ,"想要在巨星姐姐面前证明自己的18线小演员上官娣娣，和多年期待真爱却在最后被狠狠出卖的空间站黑鸟面馆老板娘许春梅，当两个人的世界以想象不到的方式不期而遇，她们的命运会发生什么样的改变?"
];
let userName = "";
if(getInfo().userName){
    userName=getInfo().userName
}

$(function(){
    $('.movieAlert').on('click',function () {
        $('.content').html(arr[$('.movieAlert').index(this)]);
        $('.shadow').show()
    });
    $('.shadow').on('click',function () {
        $(this).hide()
    });
    //点击抢卷按钮
    $('.shareBtn').on('click',function () {
        $.ajax({
            url: 'pickBoluomeCoupon',
            data:{'sceneId':'387','userName':userName},
            type: 'post',
            success:function (data) {
                data=eval('(' + data + ')');
                if(data.success){
                    requestMsg("领劵成功")
                }else{
                    if(data.url){
                        if (getBlatFrom() == 2) {
                            location.href=data.url;
                        }else{
                            requestMsg("请退出当前活动页面,登录后再进行领劵");
                        }
                    }else{
                        requestMsg(data.msg);
                    }
                }

            }
        });
    })
});